ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/HSM_HSM_PKA_CE010000h.xml
<module name="HSM_PKA" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="HSM_PKA_PKA_APTR" acronym="HSM_PKA_PKA_APTR" offset="0" width="32" description="A operand address offset.">
		<bitfield id="RESERVED_1" width="10" begin="21" end="12" resetval="0x0" description="Set to zero on Write, ignore on Read." range="21:12" rwaccess="W"/>
	<bitfield id="GF2M_ACC" width="1" begin="11" end="11" resetval="0x0" description="When set, this bit specifies that Vector A is located within the operand registers of the GF2m Engine." range="11" rwaccess="R/W"/>
	<bitfield id="APTR" width="11" begin="10" end="0" resetval="0x0" description="These bits specify the location of Vector A within the PKA RAM. Vectors are identified through the location of their least-significant 32-bit word. Note that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary." range="10:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_BPTR" acronym="HSM_PKA_PKA_BPTR" offset="4" width="32" description="B operand address offset.">
		<bitfield id="RESERVED_1" width="10" begin="21" end="12" resetval="0x0" description="Set to zero on Write, ignore on Read." range="21:12" rwaccess="W"/>
	<bitfield id="GF2M_ACC" width="1" begin="11" end="11" resetval="0x0" description="When set, this bit specifies that Vector B is located within the operand registers of the GF2m Engine." range="11" rwaccess="R/W"/>
	<bitfield id="BPTR" width="11" begin="10" end="0" resetval="0x0" description="These bits specify the location of Vector B within the PKA RAM. Vectors are identified through the location of their least-significant 32-bit word. Note that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary." range="10:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_CPTR" acronym="HSM_PKA_PKA_CPTR" offset="8" width="32" description="C operand/result address offset.">
		<bitfield id="RESERVED_1" width="10" begin="21" end="12" resetval="0x0" description="Set to zero on Write, ignore on Read." range="21:12" rwaccess="W"/>
	<bitfield id="GF2M_ACC" width="1" begin="11" end="11" resetval="0x0" description="When set, this bit specifies that Vector C is located within the operand registers of the GF2m Engine." range="11" rwaccess="R/W"/>
	<bitfield id="CPTR" width="11" begin="10" end="0" resetval="0x0" description="These bits specify the location of Vector C within the PKA RAM. Vectors are identified through the location of their least-significant 32-bit word. Note that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary." range="10:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_DPTR" acronym="HSM_PKA_PKA_DPTR" offset="12" width="32" description="D operand/result address offset.">
		<bitfield id="RESERVED_1" width="10" begin="21" end="12" resetval="0x0" description="Set to zero on Write, ignore on Read." range="21:12" rwaccess="W"/>
	<bitfield id="GF2M_ACC" width="1" begin="11" end="11" resetval="0x0" description="When set, this bit specifies that Vector D is located within the operand registers of the GF2m Engine." range="11" rwaccess="R/W"/>
	<bitfield id="DPTR" width="11" begin="10" end="0" resetval="0x0" description="These bits specify the location of Vector D within the PKA RAM. Vectors are identified through the location of their least-significant 32-bit word. Note that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary." range="10:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_ALENGTH" acronym="HSM_PKA_PKA_ALENGTH" offset="16" width="32" description="Length of A operand.">
		<bitfield id="RESERVED_1" width="22" begin="31" end="10" resetval="0x0" description="Set to zero on Write, ignore on Read." range="31:10" rwaccess="W"/>
	<bitfield id="ALENGTH" width="10" begin="9" end="0" resetval="0x0" description="This register specifies the length [in 32-bit words] of Vector A." range="9:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_BLENGTH" acronym="HSM_PKA_PKA_BLENGTH" offset="20" width="32" description="Length of B operand.">
		<bitfield id="RESERVED_1" width="22" begin="31" end="10" resetval="0x0" description="Set to zero on Write, ignore on Read." range="31:10" rwaccess="W"/>
	<bitfield id="BLENGTH" width="10" begin="9" end="0" resetval="0x0" description="This register specifies the length [in 32-bit words] of Vector A." range="9:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_SHIFT" acronym="HSM_PKA_PKA_SHIFT" offset="24" width="32" description="Bits to shift.">
		<bitfield id="RESERVED_1" width="26" begin="31" end="6" resetval="0x0" description="Set to zero on Write, ignore on Read." range="31:6" rwaccess="W"/>
	<bitfield id="BITS_TO_SHIFT" width="5" begin="4" end="0" resetval="0x0" description="This register specifies the number of bits to shift the input vector [in the range 0- 31] during a Rshift or Lshift operation" range="4:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_FUNCTION" acronym="HSM_PKA_PKA_FUNCTION" offset="28" width="32" description="Function code, Run control/status, Stall Result control.">
		<bitfield id="RESERVED_3" width="7" begin="31" end="25" resetval="0x0" description="Set to zero on Write, ignore on Read" range="31:25" rwaccess="W"/>
	<bitfield id="STALL_RESULT" width="1" begin="24" end="24" resetval="0x0" description="When written with a1b updating of the PKA_COMPARE, PKA_MSW and PKA_DIVMSW registers, as well as resetting the Run bit is stalled beyond the point that a running operation is actually finished. Use this to allow software enough time to read results from a previous operation when the newly started operation is known to take only a short amount of time. If a result is waiting, the result registers is updated and the Run bit is reset in the clock cycle following Writing the Stall Result bit back to0b The Stall result function may only be used for basic PKCP operations" range="24" rwaccess="R/W"/>
	<bitfield id="RESERVED_2" width="5" begin="23" end="19" resetval="0x0" description="Set to zero on Write, ignore on Read." range="23:19" rwaccess="W"/>
	<bitfield id="SEQUENCER_OPERATIONS_EXTEND" width="3" begin="18" end="16" resetval="0x0" description="These bits are an extend of bits [14:12] to select the complex Sequencer operation to perform" range="18:16" rwaccess="R/W"/>
	<bitfield id="RUN" width="1" begin="15" end="15" resetval="0x1" description="The host sets this bit to instruct the PKA module to begin processing the basic PKCP or complex Sequencer operation. This bit is reset low automatically when the operation is complete. The complement of this bit is available as interrupt see sections 5.6.5 and 5.6.6. After a reset, the Run bit is always set to1b Depending on the configuration, Program ROM or Program RAM, the following applies: Program ROM The first Sequencer instruction sets the bit to0b This is done immediately after the hardware reset is released. Program RAM The Sequencer needs to set the bit to0b As a valid firmware may not have been loaded, the Sequencer is held in software reset after the hardware reset is released [the Reset bit in PKA_SEQ_CRTL is set to1b. After the FW image is loaded and the Reset bit is cleared, the Sequencer starts to execute the FW. The first instruction clears the Run bit. In both cases a few clock cycles are needed before the first instruction is executed and the Run bit state has been propagated" range="15" rwaccess="R/W"/>
	<bitfield id="SEQ_OP" width="3" begin="14" end="12" resetval="0x0" description="These bits in combination with bits [18:16] select the complex Sequencer operation to perform" range="14:12" rwaccess="R/W"/>
	<bitfield id="COPY" width="1" begin="11" end="11" resetval="0x0" description="Perform copy operation." range="11" rwaccess="R/W"/>
	<bitfield id="COMPARE" width="1" begin="10" end="10" resetval="0x0" description="Perform compare operation" range="10" rwaccess="R/W"/>
	<bitfield id="MODULO" width="1" begin="9" end="9" resetval="0x0" description="Perform modulo operation." range="9" rwaccess="R/W"/>
	<bitfield id="DIVIDE" width="1" begin="8" end="8" resetval="0x0" description="Perform divide operation." range="8" rwaccess="R/W"/>
	<bitfield id="LSHIFT" width="1" begin="7" end="7" resetval="0x0" description="Perform left shift operation." range="7" rwaccess="R/W"/>
	<bitfield id="RSHIFT" width="1" begin="6" end="6" resetval="0x0" description="Perform right shift operation" range="6" rwaccess="R/W"/>
	<bitfield id="SUBTRACT" width="1" begin="5" end="5" resetval="0x0" description="Perform subtract operation" range="5" rwaccess="R/W"/>
	<bitfield id="ADD" width="1" begin="4" end="4" resetval="0x0" description="Perform add operation" range="4" rwaccess="R/W"/>
	<bitfield id="MS_ONE" width="1" begin="3" end="3" resetval="0x0" description="Loads the location of the Most Significant one bit within the result word indicated in the PKA_MSW register into bits [4:0] of the PKA_DIVMSW register - can only be used with basic PKCP operations8 , except for Divide, Modulo and Compare." range="3" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="1" begin="2" end="2" resetval="0x0" description="Set to zero on Write, ignore on Read" range="2" rwaccess="W"/>
	<bitfield id="ADDSUB" width="1" begin="1" end="1" resetval="0x0" description="Perform combined Add/Subtract operation" range="1" rwaccess="R/W"/>
	<bitfield id="MULTIPLY" width="1" begin="0" end="0" resetval="0x0" description="Perform multiply operation." range="0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_COMPARE" acronym="HSM_PKA_PKA_COMPARE" offset="32" width="32" description="Result of compare.">
		<bitfield id="RESERVED_1" width="29" begin="31" end="3" resetval="0x0" description="Ignore on Read." range="31:3" rwaccess="W"/>
	<bitfield id="A_GREATER_THAN_B" width="1" begin="2" end="2" resetval="0x0" description="Vector_A is greater than Vector_B." range="2" rwaccess="R"/>
	<bitfield id="A_LESS_THAN_B" width="1" begin="1" end="1" resetval="0x0" description="Vector_A is less than Vector_B." range="1" rwaccess="R"/>
	<bitfield id="A_EQUAL_B" width="1" begin="0" end="0" resetval="0x1" description="Vector_A is equal to Vector_B." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_PKA_MSW" acronym="HSM_PKA_PKA_MSW" offset="36" width="32" description="MS non-zero word address.">
		<bitfield id="RESERVED_2" width="16" begin="31" end="16" resetval="0x0" description="Ignore on Read." range="31:16" rwaccess="W"/>
	<bitfield id="RESULT_IS_ZERO" width="1" begin="15" end="15" resetval="0x1" description="The result vector is all zeroes; ignore the address returned in bits [10:0]." range="15" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="3" begin="14" end="12" resetval="0x0" description="Ignore on Read." range="14:12" rwaccess="W"/>
	<bitfield id="GF2M_ACC" width="1" begin="11" end="11" resetval="0x0" description="When set, this bit specifies that the result vector is located within the operand registers of the GF2m Engine." range="11" rwaccess="R"/>
	<bitfield id="MSW_ADDRESS" width="11" begin="10" end="0" resetval="0x0" description="Address of the most significant non-zero 32-bit word of the result vector in PKA RAM." range="10:0" rwaccess="R"/>
	</register><register id="HSM_PKA_PKA_DIVMSW" acronym="HSM_PKA_PKA_DIVMSW" offset="40" width="32" description="MS non-zero word address for remainder (MOD and DIV ops).">
		<bitfield id="RESERVED_2" width="16" begin="31" end="16" resetval="0x0" description="Ignore on Read." range="31:16" rwaccess="W"/>
	<bitfield id="RESULT_IS_ZERO" width="1" begin="15" end="15" resetval="0x1" description="The result vector is all zeroes; ignore the address returned in bits [10:0]." range="15" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="3" begin="14" end="12" resetval="0x0" description="Ignore on Read." range="14:12" rwaccess="W"/>
	<bitfield id="GF2M_ACC" width="1" begin="11" end="11" resetval="0x0" description="When set, this bit specifies that the result vector is located within the operand registers of the GF2m Engine." range="11" rwaccess="R"/>
	<bitfield id="MSW_ADDRESS" width="11" begin="10" end="0" resetval="0x0" description="The description of the bits in this field depends on the value of the MS one bit in PKA_FUNCTION register. When MS one bit is0b Msw_Address[10:0] Address of the most significant non-zero 32-bit word of the Remainder result vector in PKA RAM. When MS one bit is1b Msw_bit_position[4:0] Reports the bit number of the most significant non-zero bit in the most significant non-zero word in PKA RAM. Remaining bits [10:5] are reserved." range="10:0" rwaccess="R"/>
	</register><register id="HSM_PKA_LNME1_STATUS" acronym="HSM_PKA_LNME1_STATUS" offset="64" width="32" description="LNME 1 status register.">
		<bitfield id="RESERVED_1" width="26" begin="31" end="6" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:6" rwaccess="W"/>
	<bitfield id="STICKY_ZERO" width="1" begin="5" end="5" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the result of an MMM* or EXP operation is equal to zero or equal to the modulus N. Updated at the end of an operation [setonly], not cleared to0bby hardware on start of any operation [must be cleared by whoever is controlling the LNME]. Updating this bit is optional when requesting a 'fast ' MMM3A operation via the LNME_FAST_MMM register" range="5" rwaccess="R/W"/>
	<bitfield id="STICKY_OFLO" width="1" begin="4" end="4" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the result of an MMM* or EXP operation is equal to- or greater than the modulus N. Updated at the end of an operation [setonly], not cleared to0bby hardware on start of any operation [must be cleared by whoever is controlling the LNME]. Updating this bit is optional when requesting a 'fast ' MMM3A operation via the LNME_FAST_MMM register." range="4" rwaccess="R/W"/>
	<bitfield id="RESULT_ZERO" width="1" begin="3" end="3" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the result of an MMM* or EXP operation is equal to zero or equal to the modulus N. Updated at the end of an operation, automatically cleared to0bby hardware on start of any operation" range="3" rwaccess="R/W"/>
	<bitfield id="CMD_ERROR" width="1" begin="2" end="2" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when trying to start multiple operations in one command, automatically cleared to0bby hardware on start of any [legal] operation" range="2" rwaccess="R/W"/>
	<bitfield id="MMM_BUSY" width="1" begin="1" end="1" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the LNME executes an MMM* or EXP operation [cannot be written to0bduring execution of an operation]. Automatically cleared to0bby hardware when finishing an operation. The LNME interrupt is the complement of this bit and can be controlled directly for testing purposes when no actual operation is busy." range="1" rwaccess="R/W"/>
	<bitfield id="OVERFLOW" width="1" begin="0" end="0" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the result of an MMM* or EXP operation is equal to- or greater than the modulus N. Updated at the end of an operation, automatically cleared to0bby hardware on start of any operation" range="0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME1_CONTROL" acronym="HSM_PKA_LNME1_CONTROL" offset="68" width="32" description="LNME 1 control register (no SW reset).">
		<bitfield id="RESERVED_2" width="26" begin="31" end="6" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:6" rwaccess="W"/>
	<bitfield id="RESET" width="1" begin="5" end="5" resetval="0x0" description="Set-only, reset value0b When set to1b the LNME is reset and all internal storage locations are flushed [including the LNME FIFO RAM[s]], cleared to0bby hardware at the end of the operation. This command has priority over the MMM* and EXP commands and can abort those in mid-execution. Note: Bit [5] is 'Reserved ' in the LNME1_CONTROL register. For a dual LNME, the 'reset ' bit in the LNME0_CONTROL register controls the software reset in both LNMEs" range="5" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="2" begin="4" end="3" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read. For backward compatibility, these bits are actually connected to flip-flops." range="4:3" rwaccess="W"/>
	<bitfield id="EXP_CMD" width="1" begin="2" end="2" resetval="0x0" description="Set-only, reset value0b When set to1b the LNME starts an EXP operation; cleared to0bby hardware at the end of the operation or when executing a RESET command" range="2" rwaccess="R/W"/>
	<bitfield id="MMMNEXT_CMD" width="1" begin="1" end="1" resetval="0x0" description="Set-only, reset value0b When set to1b the LNME starts an MMMNEXT operation; cleared to0bby hardware at the end of the operation or when executing a RESET command. Note: Setting bits [1] and [0] at the same time starts an MMM3A operation, whereby the result of the MMM operation is written to the offset in PKA data RAM specified by the bbase field in the LNME*_BBASE register. These bits are cleared to 0 by hardware at the end of the operation or when executing a RESET command." range="1" rwaccess="R/W"/>
	<bitfield id="MMM_CMD" width="1" begin="0" end="0" resetval="0x0" description="Set-only, reset value0b When set to1b the LNME starts an MMM operation; cleared to0bby hardware at the end of the operation or when executing a RESET command." range="0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME1_NBASE" acronym="HSM_PKA_LNME1_NBASE" offset="96" width="32" description="N-Operand BASE Address, Y-Operand and N-Operand 32-bit 'Digits '">
		<bitfield id="RESERVED_2" width="6" begin="31" end="26" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read" range="31:26" rwaccess="W"/>
	<bitfield id="NYDIGITS" width="10" begin="25" end="16" resetval="0x0" description="Y-Operand and N-Operand 32-bit'digits' [offset by 1]. Also used for X-operand length in an EXP operation. Minimum value is 0 [for 32 bit operands], maximum value is 12810 [for4128bit operands, actually4096'real ' data bits plus 32 bits to handle inputs and results higher than the4096bits modulus value]." range="25:16" rwaccess="R/W"/>
	<bitfield id="MOD_RD" width="1" begin="15" end="15" resetval="0x0" description="Setting this bit to1bindicates that the modulus should be read from the GF2m Engine 's GF2M_OPERAND_A_0..15 [bits [511:0]] and GF2M_OPERAND_B_0..7 [bits [767:512]] registers. Note: When this bit is set, the nbase field contents become 'don 't care '." range="15" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="4" begin="14" end="11" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="14:11" rwaccess="W"/>
	<bitfield id="NBASE" width="10" begin="10" end="1" resetval="0x0" description="N-Operand Base Address." range="10:1" rwaccess="R/W"/>
	<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description=" Bit [0] is forced to 0 to locate the first 32 bits word at a 64 bit word boundary." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_LNME1_XBASE" acronym="HSM_PKA_LNME1_XBASE" offset="100" width="32" description="X-Operand BASE Address, X-Operand 32-bit 'Digits '.">
		<bitfield id="RESERVED_2" width="6" begin="31" end="26" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:26" rwaccess="W"/>
	<bitfield id="MMM_CMD" width="10" begin="25" end="16" resetval="0x0" description="X-Operand 32-bit'digits' [offset by 1], used for MMM* operations only. Minimum value is 0 [for 32 bit X operands], maximum value is 12811 [for4128bit X operands, actually4096'real ' data bits plus 2 extra bits to handle X inputs up to four times the4096bits modulus value, plus 30 dummy data bits to fill out the last word which should all be 0]." range="25:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="5" begin="15" end="11" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="15:11" rwaccess="W"/>
	<bitfield id="XBASE" width="10" begin="10" end="1" resetval="0x0" description="X-Operand Base Address. " range="10:1" rwaccess="R/W"/>
	<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description=" Bit [0] is forced to 0 to locate the first 32 bits word at a 64 bit word boundary." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_LNME1_YBASE" acronym="HSM_PKA_LNME1_YBASE" offset="104" width="32" description="Y-Operand BASE Address, MMM Passes.">
		<bitfield id="RESERVED_2" width="8" begin="31" end="24" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:24" rwaccess="W"/>
	<bitfield id="NPASSES" width="8" begin="23" end="16" resetval="0x0" description="MMM passes. Minimum value is 0 [for ONE pass], maximum value is 255 for 256 passes." range="23:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="5" begin="15" end="11" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="15:11" rwaccess="W"/>
	<bitfield id="YBASE" width="10" begin="10" end="1" resetval="0x0" description="Y-Operand Base Address. " range="10:1" rwaccess="R/W"/>
	<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description=" Bit [0] is forced to 0 to locate the first 32 bits word at a 64 bit word boundary." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_LNME1_BBASE" acronym="HSM_PKA_LNME1_BBASE" offset="108" width="32" description="B-Operand BASE Address, B-Operand Bit Count.">
		<bitfield id="RESERVED_2" width="1" begin="31" end="31" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31" rwaccess="W"/>
	<bitfield id="BCNTR" width="15" begin="30" end="16" resetval="0x0" description="B-Operand Bit Count. Minimum value is 0 for an exponent length of 2 bits, maximum value is 409513 for an exponent of4097bits [to allow exponent blinding]. If no exponent blinding is used the exponent would normally be smaller than the modulus. Note that the most significant B operand bit need not be stored in memory and is always assumed to be1b" range="30:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="5" begin="15" end="11" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="15:11" rwaccess="W"/>
	<bitfield id="BBASE" width="10" begin="10" end="1" resetval="0x0" description="B-Operand BASE Address." range="10:1" rwaccess="R/W"/>
	<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description=" Bit [0] is forced to 0 to locate the first 32 bits word at a 64 bit word boundary." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_LNME1_NACC" acronym="HSM_PKA_LNME1_NACC" offset="112" width="32" description="N ', N ' calculation busy flag, exponent array size for EXP.">
		<bitfield id="RESERVED_2" width="6" begin="26" end="21" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="26:21" rwaccess="W"/>
	<bitfield id="EXPARRAY" width="5" begin="20" end="16" resetval="0x0" description="Exponent Array. A minimum [default] value of 0 indicates that there is only odd power: AR mod N. This is the value of exparray when exponent re-coding is not used. A maximum value of 31 indicates 32 odd powers can be used for exponent re-coding, this includes A1R mod N as the first 'odd power '." range="20:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="7" begin="15" end="9" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="15:9" rwaccess="W"/>
