ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/HSM_HSM_PKA_CE010000h.xml
	<bitfield id="NACC_BUSY" width="1" begin="8" end="8" resetval="0x0" description="Reset-only - nacc Calculation Busy, set to1bduring 8 clock cycles after Writing nzero in LNME*_NZERO while nacc is being calculated. During this time, operation starts are stalled. Writing this bit with0baborts the calculation but can leave nacc in an unknown state [Writing NACC while resetting nacc_busy prevents this]." range="8" rwaccess="R/W"/>
	<bitfield id="NACC" width="8" begin="7" end="0" resetval="0x0" description="N Accent. Any odd [bit [0] is1b 8 bit value can be loaded here [result of calculation]. Automatically loaded with calculated value after Writing nzero in LNME*_NZERO." range="7:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME1_NZERO" acronym="HSM_PKA_LNME1_NZERO" offset="116" width="32" description="Lowest byte of N-Operand for N ' calculation.">
		<bitfield id="RESERVED_1" width="24" begin="31" end="8" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:8" rwaccess="W"/>
	<bitfield id="NZERO" width="8" begin="7" end="0" resetval="0x0" description="N vector Byte 0. Any odd [bit [0] is1b 8 bit value can be loaded here. Writing starts the nacc calculation automatically." range="7:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME0_STATUS" acronym="HSM_PKA_LNME0_STATUS" offset="128" width="32" description="LNME 0 status register.">
		<bitfield id="RESERVED_1" width="26" begin="31" end="6" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:6" rwaccess="W"/>
	<bitfield id="STICKY_ZERO" width="1" begin="5" end="5" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the result of an MMM* or EXP operation is equal to zero or equal to the modulus N. Updated at the end of an operation [setonly], not cleared to0bby hardware on start of any operation [must be cleared by whoever is controlling the LNME]. Updating this bit is optional when requesting a 'fast ' MMM3A operation via the LNME_FAST_MMM register" range="5" rwaccess="R/W"/>
	<bitfield id="STICKY_OFLO" width="1" begin="4" end="4" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the result of an MMM* or EXP operation is equal to- or greater than the modulus N. Updated at the end of an operation [setonly], not cleared to0bby hardware on start of any operation [must be cleared by whoever is controlling the LNME]. Updating this bit is optional when requesting a 'fast ' MMM3A operation via the LNME_FAST_MMM register." range="4" rwaccess="R/W"/>
	<bitfield id="RESULT_ZERO" width="1" begin="3" end="3" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the result of an MMM* or EXP operation is equal to zero or equal to the modulus N. Updated at the end of an operation, automatically cleared to0bby hardware on start of any operation" range="3" rwaccess="R/W"/>
	<bitfield id="CMD_ERROR" width="1" begin="2" end="2" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when trying to start multiple operations in one command, automatically cleared to0bby hardware on start of any [legal] operation" range="2" rwaccess="R/W"/>
	<bitfield id="MMM_BUSY" width="1" begin="1" end="1" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the LNME executes an MMM* or EXP operation [cannot be written to0bduring execution of an operation]. Automatically cleared to0bby hardware when finishing an operation. The LNME interrupt is the complement of this bit and can be controlled directly for testing purposes when no actual operation is busy." range="1" rwaccess="R/W"/>
	<bitfield id="OVERFLOW" width="1" begin="0" end="0" resetval="0x0" description="Read/write, reset value0b set to1bby hardware when the result of an MMM* or EXP operation is equal to- or greater than the modulus N. Updated at the end of an operation, automatically cleared to0bby hardware on start of any operation" range="0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME0_CONTROL" acronym="HSM_PKA_LNME0_CONTROL" offset="132" width="32" description="LNME 0 control register.">
		<bitfield id="RESERVED_2" width="26" begin="31" end="6" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:6" rwaccess="W"/>
	<bitfield id="RESET_CMD" width="1" begin="5" end="5" resetval="0x0" description="Set-only, reset value0b When set to1b the LNME is reset and all internal storage locations are flushed [including the LNME FIFO RAM[s]], cleared to0bby hardware at the end of the operation. This command has priority over the MMM* and EXP commands and can abort those in mid-execution. Note: Bit [5] is 'Reserved ' in the LNME1_CONTROL register. For a dual LNME, the 'reset ' bit in the LNME0_CONTROL register controls the software reset in both LNMEs" range="5" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="2" begin="4" end="3" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read. For backward compatibility, these bits are actually connected to flip-flops." range="4:3" rwaccess="W"/>
	<bitfield id="EXP_CMD" width="1" begin="2" end="2" resetval="0x0" description="Set-only, reset value0b When set to1b the LNME starts an EXP operation; cleared to0bby hardware at the end of the operation or when executing a RESET command" range="2" rwaccess="R/W"/>
	<bitfield id="MMMNEXT_CMD" width="1" begin="1" end="1" resetval="0x0" description="Set-only, reset value0b When set to1b the LNME starts an MMMNEXT operation; cleared to0bby hardware at the end of the operation or when executing a RESET command. Note: Setting bits [1] and [0] at the same time starts an MMM3A operation, whereby the result of the MMM operation is written to the offset in PKA data RAM specified by the bbase field in the LNME*_BBASE register. These bits are cleared to 0 by hardware at the end of the operation or when executing a RESET command." range="1" rwaccess="R/W"/>
	<bitfield id="MMM_CMD" width="1" begin="0" end="0" resetval="0x0" description="Set-only, reset value0b When set to1b the LNME starts an MMM operation; cleared to0bby hardware at the end of the operation or when executing a RESET command." range="0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME_DATAPATH" acronym="HSM_PKA_LNME_DATAPATH" offset="136" width="32" description="PE bypass and dual LNME linking control.">
		<bitfield id="RESERVED_3" width="15" begin="30" end="16" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="30:16" rwaccess="W"/>
	<bitfield id="LINKUP" width="1" begin="15" end="15" resetval="0x0" description="This bit controls the 'linking ' of the two LNME PE chains in a dual LNME [if configured, otherwise this field must be treated as 'Reserved ']. When set to1b all PEs of the 2nd chain are inserted at the end of the 1st chain [in front of the 'terminating PE '], the X-FIFOs are combined into one and the LNME FIFO memories are combined to form a dual depth FIFO.Note: This bit cannot be changed while an operation is busy in either the 1st or the 2nd LNME." range="15" rwaccess="R/W"/>
	<bitfield id="RESERVED_2" width="4" begin="14" end="11" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="14:11" rwaccess="W"/>
	<bitfield id="BYPASS_1" width="3" begin="10" end="8" resetval="0x0" description="This field controls the PE chain bypass multiplexers for the 2nd LNME. The number of bits is 3 for 12-PE configurations.Note: This field cannot be changed while an operation is busy in the 2nd LNME." range="10:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="5" begin="7" end="3" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="7:3" rwaccess="W"/>
	<bitfield id="BYPASS_0" width="3" begin="2" end="0" resetval="0x0" description="This field controls the PE chain bypass multiplexers for the 1st LNME. The number of bits is 3 for 12-PE configurations.Note: This field cannot be changed while an operation is busy in the 1st LNME." range="2:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME_FAST_CTRL" acronym="HSM_PKA_LNME_FAST_CTRL" offset="144" width="32" description="Fast MMM3A/ADDSUB op control.">
		<bitfield id="UPDATE" width="1" begin="31" end="31" resetval="0x0" description="Write-only, bit should be written with1bwhen updating bits [30:16], always reads0b When Writing this bit with a0b bits [30:16] will not be changed irrespective the values written there. Updating bits [30:16] can only be done with a single write action, separate Byte writes are not possible." range="31" rwaccess="R/W"/>
	<bitfield id="XOR_VALUE" width="5" begin="30" end="26" resetval="0x0" description="This field controls the value XOR-ed into the vector index fields of the LNME_FAST_MMM and LNME_FAST_STRT registers when the xor_ctrl is1bupon starting an MMM3A and/or PKCP ADDSUB operation using those registers. The actual XOR is only done when a vector index field equals the cmp_value field in the bits that are1bin the cmp_mask field. To modify this field, the update bit should be written with a1b" range="30:26" rwaccess="R/W"/>
	<bitfield id="CMP_VALUE" width="5" begin="25" end="21" resetval="0x0" description="This field contains bits that are compared against the vector index fields of the LNME_FAST_MMM and LNME_FAST_STRT registers when starting an MMM3A and/or PKCP ADDSUB operation using those registers. Comparison is only done for the corresponding1bbits in the cmp_mask field, other bits are don 't care. To modify this field, the update bit should be written with a 1b" range="25:21" rwaccess="R/W"/>
	<bitfield id="CMP_MASK" width="5" begin="20" end="16" resetval="0x0" description="This field controls which bits of the vector index fields of the LNME_FAST_MMM and LNME_FAST_STRT registers are compared against cmp_value when starting an MMM3A and/or PKCP ADDSUB operation using those registers. A1bin this field compares the corresponding bit in the cmp_value field; a0bin this field makes the corresponding cmp_value bit a don 't care. To modify this field, the update bit should be written with a1b" range="20:16" rwaccess="R/W"/>
	<bitfield id="IGNORED" width="14" begin="14" end="1" resetval="0x0" description="These bits are ignored on a write and will read zero on a read. These bits are intended to allow Writing any value to bits [15:1] while setting the xor_ctrl bit" range="14:1" rwaccess="R/W"/>
	<bitfield id="XOR_CTRL" width="1" begin="0" end="0" resetval="0x0" description="This bit controls whether or not the value in the xor_mask field is XOR-ed into the vector index fields of the LNME_FAST_MMM and LNME_FAST_STRT registers. The state of this bit is logged with an MMM3A or ADDSUB operation request using those registers and may be changed immediately after that point." range="0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME_FAST_STRT" acronym="HSM_PKA_LNME_FAST_STRT" offset="148" width="32" description="Fast ADDSUB operation start (in PKCP).">
		<bitfield id="REQUEST_SUB" width="1" begin="31" end="31" resetval="0x0" description="This bit controls which operation is actually performed in the PKCP:A0brequests an ADD operation, which is performed using the ADDSUB A+C-B operation, with the A and C vectors controlled by the addsub_a and addsub_bc fields here. The B vector of the PKCP should point to a suitable vector containing the value zero. As both the input vectors can be up to 2 times the Modulus in value, the result can be close to 4 times the Modulus vector value.A1brequests a SUB operation, which is performed using the ADDSUB A+C-B operation, with the A and B vectors controlled by the addsub_a and addsub_bc fields here. The C vector of the PKCP should point to a suitable vector containing 2 times the Modulus value. As both the input vectors can be up to 2 times the Modulus in value, the result can be close to 4 times the Modulus vector value [in case A is at its maximum value and B equals zero]." range="31" rwaccess="R/W"/>
	<bitfield id="ADDSUB_D" width="5" begin="30" end="26" resetval="0x0" description="This holds the index for the PKCP ADDSUB result vector 'D ' in the table [before possible XOR-ing with the xor_value field in the LNME_FAST_CTRL register]." range="30:26" rwaccess="R/W"/>
	<bitfield id="ADDSUB_BC" width="5" begin="25" end="21" resetval="0x0" description="This holds the index for the PKCP ADDSUB operation 'B ' or 'C ' input vector in the table [before possible XOR-ing with the xor_value field in the LNME_FAST_CTRL register]." range="25:21" rwaccess="R/W"/>
	<bitfield id="ADDSUB_A" width="5" begin="20" end="16" resetval="0x0" description="This holds the index for the PKCP ADDSUB operation 'A ' input vector in the table [before possible XOR-ing with the xor_value field in the LNME_FAST_CTRL register]." range="20:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="13" begin="15" end="3" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="15:3" rwaccess="W"/>
	<bitfield id="LNME1_REQUEST" width="1" begin="2" end="2" resetval="0x0" description="This bit will be set to1bwhen an MMM3A operation is requested in the 2nd LNME by Writing to bits [31:16] of the LNME_FAST_MMM register with a non-zero value. The operation is started as soon as possible, i.e. when both LNMEs and the PKCP are ready for a next operation - if an operation was already busy in the 2nd LNME, the LNME1 interrupt may only activate for a single clock cycle. This bit automatically falls back to0bwhen the operation is actually started, at which point both the mmm and mmm_next bits in the LNME1_CTRL register are set to1b To abort this request, write this bit with a1b- Writing a0bhas no effect.Note: This bit is 'Reserved ' in a normal [non-dual] LNME configuration." range="2" rwaccess="R/W"/>
	<bitfield id="LNME0_REQUEST" width="1" begin="1" end="1" resetval="0x0" description="This bit will be set to1bwhen an MMM3A operation is requested in the 1st LNME by Writing to bits [15:0] of the LNME_FAST_MMM register with a non-zero value. The operation is started as soon as possible, i.e. when both LNMEs and the PKCP are ready for a next operation - if an operation was already busy in the 1st LNME, the LNME0 interrupt may only activate for a single clock cycle. This bit automatically falls back to0bwhen the operation is actually started, at which point both the mmm and mmm_next bits in the LNME0_CTRL register are set to1b To abort this request, write this bit with a1b- Writing a0bhas no effect." range="1" rwaccess="R/W"/>
	<bitfield id="PKCP_REQUEST" width="1" begin="0" end="0" resetval="0x0" description="This bit will be set to1bwhen an ADDSUB operation is requested in the PKCP by Writing to bits [31:16] of this register with a non-zero value. The operation is started as soon as possible, i.e. when both LNMEs and the PKCP are ready for a next operation. This bit automatically falls back to0bwhen the operation is actually started. To abort this request, write this bit with a1b- Writing a0bhas no effect." range="0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME_FAST_MMM" acronym="HSM_PKA_LNME_FAST_MMM" offset="152" width="32" description="Fast MMM3A operation start.">
		<bitfield id="STICKY_1" width="1" begin="31" end="31" resetval="0x0" description="Bit should be written with1bto request updating the sticky_oflo and sticky_zero status bits in the LNME1_STATUS register. When this bit is written0b those status bits are not modified at the end of the MMM3A operation. Note: This field is 'Reserved ' in a normal [non-dual] LNME configuration." range="31" rwaccess="R/W"/>
	<bitfield id="RINDEX_1" width="5" begin="30" end="26" resetval="0x0" description="This holds the index for the 2nd LNME 's result vector in the table [before possible XOR-ing with the xor_value field in the LNME_FAST_CTRL register]. Note: This field is 'Reserved ' in a normal [non-dual] LNME configuration." range="30:26" rwaccess="R/W"/>
	<bitfield id="YINDEX_1" width="5" begin="25" end="21" resetval="0x0" description="This holds the index for the 2nd LNME 's Y input vector in the table [before possible XOR-ing with the xor_value field in the LNME_FAST_CTRL register]. Note: This field is 'Reserved ' in a normal [non-dual] LNME configuration." range="25:21" rwaccess="R/W"/>
	<bitfield id="XINDEX_1" width="5" begin="20" end="16" resetval="0x0" description="This holds the index for the 2nd LNME 's X input vector in the table [before possible XOR-ing with the xor_value field in the LNME_FAST_CTRL register]. Note: This field is 'Reserved ' in a normal [non-dual] LNME configuration." range="20:16" rwaccess="R/W"/>
	<bitfield id="STICKY_0" width="1" begin="14" end="14" resetval="0x0" description="Bit should be written with1bto request updating the sticky_oflo and sticky_zero status bits in the LNME0_STATUS register. When this bit is written0b those status bits are not modified at the end of the MMM3A operation." range="14" rwaccess="R/W"/>
	<bitfield id="RINDEX_0" width="4" begin="13" end="10" resetval="0x0" description="This holds the index for the 1st LNME 's result vector in the table [before possible XOR-ing with the xor_value field in the LNME_FAST_CTRL register]." range="13:10" rwaccess="R/W"/>
	<bitfield id="YINDEX_0" width="5" begin="9" end="5" resetval="0x0" description="This holds the index for the 1st LNME 's Y input vector in the table [before possible XOR-ing with the xor_value field in the LNME_FAST_CTRL register]." range="9:5" rwaccess="R/W"/>
	<bitfield id="XINDEX_0" width="5" begin="4" end="0" resetval="0x0" description="This holds the index for the 1st LNME 's X input vector in the table [before possible XOR-ing with the xor_value field in the LNME_FAST_CTRL register]." range="4:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME0_NBASE" acronym="HSM_PKA_LNME0_NBASE" offset="160" width="32" description="N-Operand BASE Address, Y-Operand and N-Operand 32-bit 'Digits '">
		<bitfield id="RESERVED_2" width="6" begin="31" end="26" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read" range="31:26" rwaccess="W"/>
	<bitfield id="NYDIGITS" width="10" begin="25" end="16" resetval="0x0" description="Y-Operand and N-Operand 32-bit'digits' [offset by 1]. Also used for X-operand length in an EXP operation. Minimum value is 0 [for 32 bit operands], maximum value is 12810 [for4128bit operands, actually4096'real ' data bits plus 32 bits to handle inputs and results higher than the4096bits modulus value]." range="25:16" rwaccess="R/W"/>
	<bitfield id="MOD_RD" width="1" begin="15" end="15" resetval="0x0" description="Setting this bit to1bindicates that the modulus should be read from the GF2m Engine 's GF2M_OPERAND_A_0..15 [bits [511:0]] and GF2M_OPERAND_B_0..7 [bits [767:512]] registers. Note: When this bit is set, the nbase field contents become 'don 't care '." range="15" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="4" begin="14" end="11" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="14:11" rwaccess="W"/>
	<bitfield id="NBASE" width="10" begin="10" end="1" resetval="0x0" description="N-Operand Base Address. " range="10:1" rwaccess="R/W"/>
	<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description=" Bit [0] is forced to 0 to locate the first 32 bits word at a 64 bit word boundary." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_LNME0_XBASE" acronym="HSM_PKA_LNME0_XBASE" offset="164" width="32" description="X-Operand BASE Address, X-Operand 32-bit 'Digits '.">
		<bitfield id="RESERVED_2" width="6" begin="31" end="26" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:26" rwaccess="W"/>
	<bitfield id="MMM_CMD" width="10" begin="25" end="16" resetval="0x0" description="X-Operand 32-bit'digits' [offset by 1], used for MMM* operations only. Minimum value is 0 [for 32 bit X operands], maximum value is 12811 [for4128bit X operands, actually4096'real ' data bits plus 2 extra bits to handle X inputs up to four times the4096bits modulus value, plus 30 dummy data bits to fill out the last word which should all be 0]." range="25:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="5" begin="15" end="11" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="15:11" rwaccess="W"/>
	<bitfield id="XBASE" width="10" begin="10" end="1" resetval="0x0" description="X-Operand Base Address. " range="10:1" rwaccess="R/W"/>
	<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description=" Bit [0] is forced to 0 to locate the first 32 bits word at a 64 bit word boundary." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_LNME0_YBASE" acronym="HSM_PKA_LNME0_YBASE" offset="168" width="32" description="Y-Operand BASE Address, MMM Passes.">
		<bitfield id="RESERVED_2" width="8" begin="31" end="24" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:24" rwaccess="W"/>
	<bitfield id="NPASSES" width="8" begin="23" end="16" resetval="0x0" description="MMM passes. Minimum value is 0 [for ONE pass], maximum value is 255 for 256 passes." range="23:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="5" begin="15" end="11" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="15:11" rwaccess="W"/>
	<bitfield id="YBASE" width="10" begin="10" end="1" resetval="0x0" description="Y-Operand Base Address. " range="10:1" rwaccess="R/W"/>
	<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description=" Bit [0] is forced to 0 to locate the first 32 bits word at a 64 bit word boundary." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_LNME0_BBASE" acronym="HSM_PKA_LNME0_BBASE" offset="172" width="32" description="B-Operand BASE Address, B-Operand Bit Count.">
		<bitfield id="RESERVED_2" width="1" begin="31" end="31" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31" rwaccess="W"/>
	<bitfield id="BCNTR" width="15" begin="30" end="16" resetval="0x0" description="B-Operand Bit Count. Minimum value is 0 for an exponent length of 2 bits, maximum value is 409513 for an exponent of4097bits [to allow exponent blinding]. If no exponent blinding is used the exponent would normally be smaller than the modulus. Note that the most significant B operand bit need not be stored in memory and is always assumed to be1b" range="30:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="5" begin="15" end="11" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="15:11" rwaccess="W"/>
	<bitfield id="BBASE" width="10" begin="10" end="1" resetval="0x0" description="B-Operand BASE Address. " range="10:1" rwaccess="R/W"/>
	<bitfield id="ZERO" width="1" begin="0" end="0" resetval="0x0" description=" Bit [0] is forced to 0 to locate the first 32 bits word at a 64 bit word boundary." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_LNME0_NACC" acronym="HSM_PKA_LNME0_NACC" offset="176" width="32" description="N ', N ' calculation busy flag, exponent array size for EXP.">
		<bitfield id="RESERVED_2" width="6" begin="26" end="21" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="26:21" rwaccess="W"/>
	<bitfield id="EXPARRAY" width="5" begin="20" end="16" resetval="0x0" description="Exponent Array. A minimum [default] value of 0 indicates that there is only odd power: AR mod N. This is the value of exparray when exponent re-coding is not used. A maximum value of 31 indicates 32 odd powers can be used for exponent re-coding, this includes A1R mod N as the first 'odd power '." range="20:16" rwaccess="R/W"/>
