ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/HSM_HSM_PKA_CE010000h.xml
	<bitfield id="RESERVED_1" width="7" begin="15" end="9" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="15:9" rwaccess="W"/>
	<bitfield id="NACC_BUSY" width="1" begin="8" end="8" resetval="0x0" description="Reset-only - nacc Calculation Busy, set to1bduring 8 clock cycles after Writing nzero in LNME*_NZERO while nacc is being calculated. During this time, operation starts are stalled. Writing this bit with0baborts the calculation but can leave nacc in an unknown state [Writing NACC while resetting nacc_busy prevents this]." range="8" rwaccess="R/W"/>
	<bitfield id="NACC" width="8" begin="7" end="0" resetval="0x0" description="N Accent. Any odd [bit [0] is1b 8 bit value can be loaded here [result of calculation]. Automatically loaded with calculated value after Writing nzero in LNME*_NZERO." range="7:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_LNME0_NZERO" acronym="HSM_PKA_LNME0_NZERO" offset="180" width="32" description="Lowest byte of N-Operand for N ' calculation.">
		<bitfield id="RESERVED_1" width="24" begin="31" end="8" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="31:8" rwaccess="W"/>
	<bitfield id="NZERO" width="8" begin="7" end="0" resetval="0x0" description="N vector Byte 0. Any odd [bit [0] is1b 8 bit value can be loaded here. Writing starts the nacc calculation automatically." range="7:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_SEQ_CTRL" acronym="HSM_PKA_PKA_SEQ_CTRL" offset="200" width="32" description="PKA Sequencer control/status register.">
		<bitfield id="RESET" width="1" begin="31" end="31" resetval="0x1" description="Read/Write, reset value0b[ZERO]. Writing1bwill reset the Sequencer, write to0bto restart operations again. As the reset value is0b the Sequencer will automatically start operations executing from program ROM. This bit should always be written with zero and ignored when Reading this register. Read/Write, reset value1b[ONE]. When1b the Sequencer is held in a reset state and the PKA_PROGRAM area is accessible for loading the Sequencer program [while the PKA_DATA_RAM is inaccessible], write to0bto [re]start Sequencer operations and disable PKA_PROGRAM area accessibility [also enables the PKA_DATA_RAM accesses]. Resetting the Sequencer [in order to load other firmware] should only be done when the PKA Engine is not performing any operations [i.e. the Run bit in the PKA_FUNCTION register should be zero]." range="31" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="15" begin="30" end="16" resetval="0x0" description="Bits should be written with 0 and should be ignored on a read." range="30:16" rwaccess="W"/>
	<bitfield id="SEQ_STATUS" width="8" begin="15" end="8" resetval="0x0" description="These read-only bits can be used by the Sequencer to communicate status to the outside world. Bit [8] is also used as Sequencer interrupt, with the complement of this bit OR-ed into the 'Run ' bit in PKA_FUNCTION. Refer to the SafeXcel-IP-29t2 Programmer Manual [3] for the firmware encoding of these status bits. This field should always be written with zeroes." range="15:8" rwaccess="R"/>
	<bitfield id="SW_TRIGGERS" width="8" begin="7" end="0" resetval="0x0" description="These bits can be used by software to trigger Sequencer operations. External logic can set these bits by Writing a1b can not reset them by Writing a0b The Sequencer can reset these bits by Writing a0b can not set them by Writing a1b Setting the Run bit in PKA_FUNCTION together with a non-zero Sequencer operations field automatically sets bit [0] here [firmware functionality]. Refer to the SafeXcel-IP-29t2 Programmer Manual [3] for the firmware definition of these bits." range="7:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_OPTION" acronym="HSM_PKA_PKA_OPTION" offset="244" width="32" description="PKA HW options register.">
		<bitfield id="LNME_FIFO_DEPT" width="8" begin="31" end="24" resetval="0x129" description="Number of words in the LNME 's FIFO RAM, should be ignored if LNME configuration is 0." range="31:24" rwaccess="R"/>
	<bitfield id="GF2M_CONFIG" width="2" begin="23" end="22" resetval="0x1" description="Value 0 indicates NO GF2m Engine, value 1 indicates one standard GF2m Engine [field size 571 bits, mul_depth = 4], other values are reserved." range="23:22" rwaccess="R"/>
	<bitfield id="LNME_PES" width="6" begin="21" end="16" resetval="0x12" description="Number of Processing Elements in the pipeline of the LNME, should be ignored if LNME configuration is 0." range="21:16" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="1" begin="15" end="15" resetval="0x0" description="Ignore on Read." range="15" rwaccess="W"/>
	<bitfield id="LNME_BYPASS" width="1" begin="14" end="14" resetval="0x1" description="Value1bindicates that bypass logic is present in the PEs." range="14" rwaccess="R"/>
	<bitfield id="ZEROIZATION" width="1" begin="13" end="13" resetval="0x0" description="Value1bindicates that hardware zeroization logic is present." range="13" rwaccess="R"/>
	<bitfield id="MMM3A" width="1" begin="12" end="12" resetval="0x1" description="Value1bindicates that the LNME, supports the MMM3A operation." range="12" rwaccess="R"/>
	<bitfield id="INTERRUPT_MASK" width="1" begin="11" end="11" resetval="0x0" description="Value0bindicates that the main interrupt output [bit [0] of the PKA_IRQSTATUS register] is the direct complement of the Run bit in the PKA_CONTROL register, value1bindicates that interrupt masking logic is present for this output." range="11" rwaccess="R"/>
	<bitfield id="PROT_OPTION" width="3" begin="10" end="8" resetval="0x0" description="Value 0 indicates no additional protection against side channel attacks, value 1 indicates the 'SCAP ' option, value 3 indicates the 'PROT ' option, other values reserved." range="10:8" rwaccess="R"/>
	<bitfield id="PROGRAM_RAM" width="1" begin="7" end="7" resetval="0x1" description="Value1bindicates Sequencer program storage in RAM, value0bin ROM." range="7" rwaccess="R"/>
	<bitfield id="SEQ_CONFIG" width="2" begin="6" end="5" resetval="0x1" description="Value 1 indicates a standard Sequencer, other values reserved." range="6:5" rwaccess="R"/>
	<bitfield id="LNME_CONFIG" width="3" begin="4" end="2" resetval="0x2" description="Value 0 indicates NO LNME. Value 1 indicates one standard LNME [with alpha = 32, beta = 8]. Value 2 indicates a dual LNME [with alpha = 32, beta = 8]. Other values are reserved." range="4:2" rwaccess="R"/>
	<bitfield id="PKCP_CONFIG" width="2" begin="1" end="0" resetval="0x2" description="Value 1 indicates a PKCP with a 16x16 multiplier, value 2 indicates a PKCP with a 32x32 multiplier, other values reserved." range="1:0" rwaccess="R"/>
	</register><register id="HSM_PKA_PKA_SW_REV" acronym="HSM_PKA_PKA_SW_REV" offset="248" width="32" description="PKA firmware revision and capabilities register.">
		<bitfield id="SW_CAPABILITIES" width="4" begin="31" end="28" resetval="0x0" description="4 bits binary encoding for the functionality implemented in the firmware. Refer to the SafeXcel-IP-29t2 Programmer Manual [3] for the firmware capabilities and the encoding of these bits." range="31:28" rwaccess="R"/>
	<bitfield id="SW_MAJOR_REV" width="4" begin="27" end="24" resetval="0x0" description="4 bits binary encoding of the Authentec internal major firmware revision number." range="27:24" rwaccess="R"/>
	<bitfield id="SW_MINOR_REV" width="4" begin="23" end="20" resetval="0x0" description="4 bits binary encoding of the Authentec internal minor firmware revision number." range="23:20" rwaccess="R"/>
	<bitfield id="SW_PATCH_LEVEL" width="4" begin="19" end="16" resetval="0x0" description="4 bits binary encoding of the Authentec internal firmware patch level, initial release will carry value zero. Patches are used to remove bugs without changing the functionality or interface of a module - see the release notes delivered with the package." range="19:16" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="4" begin="15" end="12" resetval="0x0" description="Bits should be ignored on a read." range="15:12" rwaccess="W"/>
	<bitfield id="CUSTOM_MAJOR_REV" width="4" begin="11" end="8" resetval="0x0" description="4 bits binary encoding of the TI specific major firmware revision number." range="11:8" rwaccess="R"/>
	<bitfield id="CUSTOM_MINOR_REV" width="4" begin="7" end="4" resetval="0x0" description="4 bits binary encoding of the TI specific minor firmware revision number." range="7:4" rwaccess="R"/>
	<bitfield id="CUSTOM_PATCH_LEVEL" width="4" begin="3" end="0" resetval="0x0" description="4 bits binary encoding of the TI specific firmware patch level, initial release will carry value zero. Patches are used to remove bugs without changing the functionality or interface of a module - see the release notes delivered with the package." range="3:0" rwaccess="R"/>
	</register><register id="HSM_PKA_PKA_REVISION" acronym="HSM_PKA_PKA_REVISION" offset="252" width="32" description="PKA HW revision register.">
		<bitfield id="RESERVED_1" width="4" begin="31" end="28" resetval="0x0" description="Bits should be ignored on a read." range="31:28" rwaccess="W"/>
	<bitfield id="HW_MAJOR_REV" width="4" begin="27" end="24" resetval="0x2" description="4 bits binary encoding of the major hardware revision number." range="27:24" rwaccess="R"/>
	<bitfield id="HW_MINOR_REV" width="4" begin="23" end="20" resetval="0x0" description="4 bits binary encoding of the minor hardware revision number." range="23:20" rwaccess="R"/>
	<bitfield id="HW_PATCH_LEVEL" width="4" begin="19" end="16" resetval="0x0" description="4 bits binary encoding of the hardware patch level, initial release will carry value zero. Patches are used to remove bugs without changing the functionality or interface of a module - see the release notes delivered with the package." range="19:16" rwaccess="R"/>
	<bitfield id="EIP_NR_COMPL" width="8" begin="15" end="8" resetval="0x227" description="Bit-by-bit logic complement of bits [7:0], EIP-28 gives 0xE3." range="15:8" rwaccess="R"/>
	<bitfield id="EIP_NR" width="8" begin="7" end="0" resetval="0x28" description="8 bits binary encoding of the EIP number, EIP-28 gives 0x1C." range="7:0" rwaccess="R"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_0" acronym="HSM_PKA_GF2M_OPERAND_A_0" offset="1024" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [31:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_1" acronym="HSM_PKA_GF2M_OPERAND_A_1" offset="1028" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [63:32]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_2" acronym="HSM_PKA_GF2M_OPERAND_A_2" offset="1032" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [95:64]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_3" acronym="HSM_PKA_GF2M_OPERAND_A_3" offset="1036" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [127:96]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_4" acronym="HSM_PKA_GF2M_OPERAND_A_4" offset="1040" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [159:128]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_5" acronym="HSM_PKA_GF2M_OPERAND_A_5" offset="1044" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [191:160]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_6" acronym="HSM_PKA_GF2M_OPERAND_A_6" offset="1048" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [223:192]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_7" acronym="HSM_PKA_GF2M_OPERAND_A_7" offset="1052" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [255:224]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_8" acronym="HSM_PKA_GF2M_OPERAND_A_8" offset="1056" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [287:256]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_9" acronym="HSM_PKA_GF2M_OPERAND_A_9" offset="1060" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [319:288]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_10" acronym="HSM_PKA_GF2M_OPERAND_A_10" offset="1064" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [351:320]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_11" acronym="HSM_PKA_GF2M_OPERAND_A_11" offset="1068" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [383:352]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_12" acronym="HSM_PKA_GF2M_OPERAND_A_12" offset="1072" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [415:384]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_13" acronym="HSM_PKA_GF2M_OPERAND_A_13" offset="1076" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [447:416]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_14" acronym="HSM_PKA_GF2M_OPERAND_A_14" offset="1080" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [479:448]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_15" acronym="HSM_PKA_GF2M_OPERAND_A_15" offset="1084" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [511:480]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_16" acronym="HSM_PKA_GF2M_OPERAND_A_16" offset="1088" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="32" begin="31" end="0" resetval="0x0" description="Operand A register [543:512]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_A_17" acronym="HSM_PKA_GF2M_OPERAND_A_17" offset="1092" width="32" description="Operand A registers.">
		<bitfield id="OPERAND_A" width="28" begin="27" end="0" resetval="0x0" description="Operand A register [571:544]" range="27:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_0" acronym="HSM_PKA_GF2M_OPERAND_B_0" offset="1152" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [31:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_1" acronym="HSM_PKA_GF2M_OPERAND_B_1" offset="1156" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [63:32]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_2" acronym="HSM_PKA_GF2M_OPERAND_B_2" offset="1160" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [95:64]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_3" acronym="HSM_PKA_GF2M_OPERAND_B_3" offset="1164" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [127:96]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_4" acronym="HSM_PKA_GF2M_OPERAND_B_4" offset="1168" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [159:128]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_5" acronym="HSM_PKA_GF2M_OPERAND_B_5" offset="1172" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [191:160]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_6" acronym="HSM_PKA_GF2M_OPERAND_B_6" offset="1176" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [223:192]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_7" acronym="HSM_PKA_GF2M_OPERAND_B_7" offset="1180" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [255:224]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_8" acronym="HSM_PKA_GF2M_OPERAND_B_8" offset="1184" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [287:256]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_9" acronym="HSM_PKA_GF2M_OPERAND_B_9" offset="1188" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [319:288]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_10" acronym="HSM_PKA_GF2M_OPERAND_B_10" offset="1192" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [351:320]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_11" acronym="HSM_PKA_GF2M_OPERAND_B_11" offset="1196" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [383:352]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_12" acronym="HSM_PKA_GF2M_OPERAND_B_12" offset="1200" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [415:384]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_13" acronym="HSM_PKA_GF2M_OPERAND_B_13" offset="1204" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [447:416]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_14" acronym="HSM_PKA_GF2M_OPERAND_B_14" offset="1208" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [479:448]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_15" acronym="HSM_PKA_GF2M_OPERAND_B_15" offset="1212" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [511:480]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_16" acronym="HSM_PKA_GF2M_OPERAND_B_16" offset="1216" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="32" begin="31" end="0" resetval="0x0" description="Operand B register [543:512]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_B_17" acronym="HSM_PKA_GF2M_OPERAND_B_17" offset="1220" width="32" description="Operand B registers.">
		<bitfield id="OPERAND_B" width="28" begin="27" end="0" resetval="0x0" description="Operand B register [571:544]" range="27:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_0" acronym="HSM_PKA_GF2M_OPERAND_C_0" offset="1280" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [31:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_1" acronym="HSM_PKA_GF2M_OPERAND_C_1" offset="1284" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [63:32]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_2" acronym="HSM_PKA_GF2M_OPERAND_C_2" offset="1288" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [95:64]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_3" acronym="HSM_PKA_GF2M_OPERAND_C_3" offset="1292" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [127:96]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_4" acronym="HSM_PKA_GF2M_OPERAND_C_4" offset="1296" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [159:128]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_5" acronym="HSM_PKA_GF2M_OPERAND_C_5" offset="1300" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [191:160]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_6" acronym="HSM_PKA_GF2M_OPERAND_C_6" offset="1304" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [223:192]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_7" acronym="HSM_PKA_GF2M_OPERAND_C_7" offset="1308" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [255:224]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_8" acronym="HSM_PKA_GF2M_OPERAND_C_8" offset="1312" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [287:256]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_9" acronym="HSM_PKA_GF2M_OPERAND_C_9" offset="1316" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [319:288]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_10" acronym="HSM_PKA_GF2M_OPERAND_C_10" offset="1320" width="32" description="Operand C registers.">
