ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/HSM_HSM_PKA_CE010000h.xml
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [351:320]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_11" acronym="HSM_PKA_GF2M_OPERAND_C_11" offset="1324" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [383:352]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_12" acronym="HSM_PKA_GF2M_OPERAND_C_12" offset="1328" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [415:384]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_13" acronym="HSM_PKA_GF2M_OPERAND_C_13" offset="1332" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [447:416]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_14" acronym="HSM_PKA_GF2M_OPERAND_C_14" offset="1336" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [479:448]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_15" acronym="HSM_PKA_GF2M_OPERAND_C_15" offset="1340" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [511:480]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_16" acronym="HSM_PKA_GF2M_OPERAND_C_16" offset="1344" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="32" begin="31" end="0" resetval="0x0" description="Operand C register [543:512]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_C_17" acronym="HSM_PKA_GF2M_OPERAND_C_17" offset="1348" width="32" description="Operand C registers.">
		<bitfield id="OPERAND_C" width="28" begin="27" end="0" resetval="0x0" description="Operand C register [571:544]" range="27:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_0" acronym="HSM_PKA_GF2M_OPERAND_D_0" offset="1408" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [31:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_1" acronym="HSM_PKA_GF2M_OPERAND_D_1" offset="1412" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [63:32]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_2" acronym="HSM_PKA_GF2M_OPERAND_D_2" offset="1416" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [95:64]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_3" acronym="HSM_PKA_GF2M_OPERAND_D_3" offset="1420" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [127:96]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_4" acronym="HSM_PKA_GF2M_OPERAND_D_4" offset="1424" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [159:128]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_5" acronym="HSM_PKA_GF2M_OPERAND_D_5" offset="1428" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [191:160]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_6" acronym="HSM_PKA_GF2M_OPERAND_D_6" offset="1432" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [223:192]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_7" acronym="HSM_PKA_GF2M_OPERAND_D_7" offset="1436" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [255:224]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_8" acronym="HSM_PKA_GF2M_OPERAND_D_8" offset="1440" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [287:256]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_9" acronym="HSM_PKA_GF2M_OPERAND_D_9" offset="1444" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [319:288]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_10" acronym="HSM_PKA_GF2M_OPERAND_D_10" offset="1448" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [351:320]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_11" acronym="HSM_PKA_GF2M_OPERAND_D_11" offset="1452" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [383:352]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_12" acronym="HSM_PKA_GF2M_OPERAND_D_12" offset="1456" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [415:384]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_13" acronym="HSM_PKA_GF2M_OPERAND_D_13" offset="1460" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [447:416]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_14" acronym="HSM_PKA_GF2M_OPERAND_D_14" offset="1464" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [479:448]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_15" acronym="HSM_PKA_GF2M_OPERAND_D_15" offset="1468" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [511:480]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_16" acronym="HSM_PKA_GF2M_OPERAND_D_16" offset="1472" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="32" begin="31" end="0" resetval="0x0" description="Operand D register [543:512]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPERAND_D_17" acronym="HSM_PKA_GF2M_OPERAND_D_17" offset="1476" width="32" description="Operand D registers.">
		<bitfield id="OPERAND_D" width="28" begin="27" end="0" resetval="0x0" description="Operand D register [571:544]" range="27:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_0" acronym="HSM_PKA_GF2M_POLYNOMIAL_0" offset="1536" width="32" description="GF2M_POLYNOMIAL_0.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [31:0]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_1" acronym="HSM_PKA_GF2M_POLYNOMIAL_1" offset="1540" width="32" description="GF2M_POLYNOMIAL_1.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [63:32]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_2" acronym="HSM_PKA_GF2M_POLYNOMIAL_2" offset="1544" width="32" description="GF2M_POLYNOMIAL_2.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [95:64]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_3" acronym="HSM_PKA_GF2M_POLYNOMIAL_3" offset="1548" width="32" description="GF2M_POLYNOMIAL_3.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [127:96]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_4" acronym="HSM_PKA_GF2M_POLYNOMIAL_4" offset="1552" width="32" description="GF2M_POLYNOMIAL_4.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [159:128]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_5" acronym="HSM_PKA_GF2M_POLYNOMIAL_5" offset="1556" width="32" description="GF2M_POLYNOMIAL_5.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [191:160]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_6" acronym="HSM_PKA_GF2M_POLYNOMIAL_6" offset="1560" width="32" description="GF2M_POLYNOMIAL_6.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [223:192]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_7" acronym="HSM_PKA_GF2M_POLYNOMIAL_7" offset="1564" width="32" description="GF2M_POLYNOMIAL_7.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [255:224]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_8" acronym="HSM_PKA_GF2M_POLYNOMIAL_8" offset="1568" width="32" description="GF2M_POLYNOMIAL_8.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [287:256]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_9" acronym="HSM_PKA_GF2M_POLYNOMIAL_9" offset="1572" width="32" description="GF2M_POLYNOMIAL_9.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [319:288]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_10" acronym="HSM_PKA_GF2M_POLYNOMIAL_10" offset="1576" width="32" description="GF2M_POLYNOMIAL_10.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [351:320]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_11" acronym="HSM_PKA_GF2M_POLYNOMIAL_11" offset="1580" width="32" description="GF2M_POLYNOMIAL_11.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [383:352]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_12" acronym="HSM_PKA_GF2M_POLYNOMIAL_12" offset="1584" width="32" description="GF2M_POLYNOMIAL_12.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [415:384]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_13" acronym="HSM_PKA_GF2M_POLYNOMIAL_13" offset="1588" width="32" description="GF2M_POLYNOMIAL_13.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [447:416]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_14" acronym="HSM_PKA_GF2M_POLYNOMIAL_14" offset="1592" width="32" description="GF2M_POLYNOMIAL_14.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [479:448]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_15" acronym="HSM_PKA_GF2M_POLYNOMIAL_15" offset="1596" width="32" description="GF2M_POLYNOMIAL_15.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [511:480]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_16" acronym="HSM_PKA_GF2M_POLYNOMIAL_16" offset="1600" width="32" description="GF2M_POLYNOMIAL_16.">
		<bitfield id="POLYNOMIAL" width="32" begin="31" end="0" resetval="0x0" description="Polynomial register [543:512]" range="31:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_POLYNOMIAL_17" acronym="HSM_PKA_GF2M_POLYNOMIAL_17" offset="1604" width="32" description="GF2M_POLYNOMIAL_17.">
		<bitfield id="POLYNOMIAL" width="28" begin="27" end="0" resetval="0x0" description="Polynomial register [571:544]" range="27:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_CMD" acronym="HSM_PKA_GF2M_CMD" offset="1792" width="32" description="Command register.">
		<bitfield id="RESERVED_4" width="17" begin="31" end="15" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="31:15" rwaccess="W"/>
	<bitfield id="TGT" width="2" begin="14" end="13" resetval="0x0" description="Target address1:00b= GF2M_OPERAND_A,01b= GF2M_OPERAND_B,10b= GF2M_OPERAND_C,11b= GF2M_OPERAND_D" range="14:13" rwaccess="R/W"/>
	<bitfield id="RESERVED_3" width="1" begin="12" end="12" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="12" rwaccess="W"/>
	<bitfield id="SRC1" width="2" begin="11" end="10" resetval="0x0" description="Source address1:00b= GF2M_OPERAND_A,01b= GF2M_OPERAND_B,10b= GF2M_OPERAND_C,11b= GF2M_OPERAND_D" range="11:10" rwaccess="R/W"/>
	<bitfield id="RESERVED_2" width="1" begin="9" end="9" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="9" rwaccess="W"/>
	<bitfield id="OPTION" width="2" begin="8" end="7" resetval="0x0" description="Source address0:00b= GF2M_OPERAND_A,01b= GF2M_OPERAND_B,10b= GF2M_OPERAND_C,11b= GF2M_OPERAND_D" range="8:7" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="2" begin="5" end="4" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="5:4" rwaccess="W"/>
	<bitfield id="OPCODE" width="3" begin="3" end="1" resetval="0x0" description="Command opcode:000bClear tgt operand register.001bCopy src0 operand to tgt operand register.010bGF[2m] Add src0 and src1 operands, write result to tgt operand.011bGF[2m] Multilpy src0 and src1 operands, write result to tgt operand.100bShift-xor-loop operation to assist a GF[2m] Inverse operation. All other opcode combinations are reserved and should not be used. Refer to Table 19 for more detailed command information." range="3:1" rwaccess="R/W"/>
	<bitfield id="CMD_SUBMIT_CMD_BUF_FULL" width="1" begin="0" end="0" resetval="0x0" description="Setting this bit [cmd_submit] submits the command that is specified by the remaining bits in this register. The cmd_submit bit is self clearing. Writing this bit with0bhas no effect. Submitting a command always sets the busy bit in GF2M_STAT. In case a second command is submitted while the engine is still busy processing, the command will be buffered internally. The cmd_buf_full bit - that is returned when Reading this bit location - will be set to indicate that command buffer is fully occupied. The cmd_buf_full bit reads0bwhen the GF2m Engine is ready to accept a new command. When this bit reads1b the command buffer is full and no new command may be written." range="0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_STAT" acronym="HSM_PKA_GF2M_STAT" offset="1796" width="32" description="Status register.">
		<bitfield id="BUSY" width="1" begin="31" end="31" resetval="0x0" description="This status bit reads1bwhen the GF2m Engine is processing a command. The irq output is the inverted level of this bit." range="31" rwaccess="R"/>
	<bitfield id="RESERVED_2" width="5" begin="30" end="26" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="30:26" rwaccess="W"/>
	<bitfield id="SHIFT_VALUE" width="10" begin="25" end="16" resetval="0x0" description="Represents the number of src0 operand right-shifts that was performed during the last 'shift-xor-loop ' operation. Note: In case the shift-xor-loop command did not find src0 bit [0] to become 'odd ' after [mul_rounds*mul_depth] cycles the shift_value reports 0x3ff, meaning 'invalid '." range="25:16" rwaccess="R"/>
	<bitfield id="CMD_ERR" width="1" begin="15" end="15" resetval="0x0" description="Command error. Set to1bby hardware when trying to start a processing using a non-valid opcode. This bit is automatically cleared to0bby hardware on a start of any [legal] operation. The command error is also triggered when the shift-xor-loop command is executed with equal pointers in the src0 and src1 fields. Note: When the first command in a sequence of two commands [buffered commands] produces an error, the cmd_err bit remains active until the engine has finished processing, regardless if the second command was valid." range="15" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="9" begin="14" end="6" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="14:6" rwaccess="W"/>
	<bitfield id="NO_MSB" width="1" begin="5" end="5" resetval="0x0" description="Result of the 'degree ' operation: If the last read operand word contains only zeroes, there is no MSB present in this word. In that case this bit will be1b" range="5" rwaccess="R"/>
	<bitfield id="MSB_PTR" width="5" begin="4" end="0" resetval="0x0" description="Result of the 'degree ' operation: Represents the index location of the MSB within the 32-bit operand word that was last read via the TCM interface." range="4:0" rwaccess="R"/>
	</register><register id="HSM_PKA_GF2M_FIELDSIZE" acronym="HSM_PKA_GF2M_FIELDSIZE" offset="1800" width="32" description="Field size register.">
		<bitfield id="RESERVED_2" width="14" begin="31" end="18" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="31:18" rwaccess="W"/>
	<bitfield id="OP_SHIFT" width="2" begin="17" end="16" resetval="0x0" description="This field must be populated with the 'operand shift ' value for the GF[2m] multiplication operation. The operand shift value is the offset from the MSB with respect to the left-shift boundaries. The operand shift value can be determined using the following expression: operand_shift = field size%mul_depth. Examples for commonly used field sizes and a multiplier depth [mul_depth] value of4:163-bit: 2 'b11,  233-bit: 2 'b01, 283-bit: 2 'b11, 409-bit: 2 'b01, 571-bit: 2 'b11" range="17:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="8" begin="15" end="8" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="15:8" rwaccess="W"/>
	<bitfield id="FIELD_SIZE" width="8" begin="7" end="0" resetval="0x0" description="This field must be populated with the number of multiplier rounds for the GF[2m] operation. The number of multiplier rounds depends on the multiplier depth and the field size:mul_rounds = [field size/mul_depth]+1. The minimum value for this register is 0x1 and the maximum value 0x8F. Examples for commonly used field sizes and a multiplier depth [mul_depth] value of4:163-bit: 0x29, 233-bit: 0x3B, 283-bit: 0x47,409-bit: 0x67, 571-bit: 0x8F" range="7:0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_GF2M_OPTIONS" acronym="HSM_PKA_GF2M_OPTIONS" offset="2040" width="32" description="GF2m module options register.">
		<bitfield id="RESERVED_2" width="4" begin="31" end="28" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="31:28" rwaccess="W"/>
	<bitfield id="OPERAND_SIZE" width="12" begin="27" end="16" resetval="0x572" description="Operand size. Represents the width of the operand registers inside the GF2m Engine. Value 0x23c means that the operand registers are 572 bits wide. The operand registers are one bit wider than the maximum supported filed size." range="27:16" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="8" begin="15" end="8" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="15:8" rwaccess="W"/>
	<bitfield id="MUL_DEPTH" width="4" begin="7" end="4" resetval="0x4" description="Multiplier matrix depth. Represents the number of AND-XOR matrix rows implemented in the GF2m Engine. Value 0x4 means that multiplier matrix contains four levels of AND-XOR matrix rows." range="7:4" rwaccess="R"/>
	<bitfield id="OPERANDS" width="4" begin="3" end="0" resetval="0x4" description="Number of implemented operand registers. Value 0x4 means four operands [A up to D]." range="3:0" rwaccess="R"/>
	</register><register id="HSM_PKA_GF2M_VERSION" acronym="HSM_PKA_GF2M_VERSION" offset="2044" width="32" description="GF2m module version register.">
		<bitfield id="RESERVED_2" width="4" begin="31" end="28" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="31:28" rwaccess="W"/>
	<bitfield id="PATCH_LEVEL" width="4" begin="27" end="24" resetval="0x2" description="These bits encode the hardware patch level of the GF2m Engine" range="27:24" rwaccess="R"/>
	<bitfield id="MINOR_VERSION" width="4" begin="23" end="20" resetval="0x0" description="These bits encode the minor version number of the GF2m Engine" range="23:20" rwaccess="R"/>
	<bitfield id="MAJOR_VERSION" width="4" begin="19" end="16" resetval="0x0" description="These bits encode the major version number of the GF2m Engine" range="19:16" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="16" begin="15" end="0" resetval="0x0" description="These bits should be written with zeroes and ignored on a read." range="15:0" rwaccess="W"/>
	</register><register id="HSM_PKA_PKA_REV" acronym="HSM_PKA_PKA_REV" offset="8160" width="32" description="Shell HW revision.">
		<bitfield id="REVISION" width="32" begin="31" end="0" resetval="0x16" description="The revision number of this EIP-29t2 module" range="31:0" rwaccess="R"/>
	</register><register id="HSM_PKA_PKA_CLK_CTRL" acronym="HSM_PKA_PKA_CLK_CTRL" offset="8168" width="32" description="PKA clock control.">
		<bitfield id="RESERVED_3" width="8" begin="30" end="23" resetval="0x0" description="This bit should be written with zero and ignored on reads. " range="30:23" rwaccess="W"/>
	<bitfield id="DATA_RAM_CLKEN" width="1" begin="22" end="22" resetval="0x0" description="Clock enable status of data_ram_clk. The reset value of this bit is0bbut after reset, this bit is immediately refreshed with the actual clock" range="22" rwaccess="R/W"/>
	<bitfield id="GF2M_CLKEN" width="1" begin="21" end="21" resetval="0x0" description="Clock enable status of gf2m_clk.The reset value of this bit is0bbut after reset, this bit is immediately refreshed with the actual clock" range="21" rwaccess="R/W"/>
	<bitfield id="LNME_REG_CLKEN" width="1" begin="20" end="20" resetval="0x0" description="Clock enable status of lnme_reg_clk. The reset value of this bit is0bbut after reset, this bit is immediately refreshed with the actual clock" range="20" rwaccess="R/W"/>
	<bitfield id="LNME_CLKEN" width="1" begin="19" end="19" resetval="0x0" description="Clock enable status of lnme_clk. The reset value of this bit is0bbut after reset, this bit is immediately refreshed with the actual clock" range="19" rwaccess="R/W"/>
	<bitfield id="PKCP_CLKEN" width="1" begin="18" end="18" resetval="0x0" description="Clock enable status of pkcp_clk.The reset value of this bit is0bbut after reset, this bit is immediately refreshed with the actual clock" range="18" rwaccess="R/W"/>
