ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/HSM_HSM_PKA_CE010000h.xml
	<bitfield id="SEQ_CLKEN" width="1" begin="17" end="17" resetval="0x0" description="Clock enable status of seq_clk. The reset value of this bit is0bbut after reset, this bit is immediately refreshed with the actual clock" range="17" rwaccess="R/W"/>
	<bitfield id="REG_CLKEN" width="1" begin="16" end="16" resetval="0x0" description="Clock enable status of reg_clk. The reset value of this bit is0bbut after reset, this bit is immediately refreshed with the actual clock" range="16" rwaccess="R/W"/>
	<bitfield id="RESERVED_2" width="1" begin="15" end="15" resetval="0x0" description="This bit should be written with zero and ignored on reads." range="15" rwaccess="W"/>
	<bitfield id="DATA_RAM_CLK_OFF" width="1" begin="14" end="14" resetval="0x0" description="Force data_ram_clk OFF" range="14" rwaccess="R/W"/>
	<bitfield id="GF2M_CLK_OFF" width="1" begin="13" end="13" resetval="0x0" description="Force gf2m_clk OFF" range="13" rwaccess="R/W"/>
	<bitfield id="LNME_REG_CLK_OFF" width="1" begin="12" end="12" resetval="0x0" description="Force lnme_reg_clk OFF" range="12" rwaccess="R/W"/>
	<bitfield id="LNME_CLK_OFF" width="1" begin="11" end="11" resetval="0x0" description="Force lnme_clk OFF" range="11" rwaccess="R/W"/>
	<bitfield id="PKCP_CLK_OFF" width="1" begin="10" end="10" resetval="0x0" description="Force pkcp_clk OFF" range="10" rwaccess="R/W"/>
	<bitfield id="SEQ_CLK_OFF" width="1" begin="9" end="9" resetval="0x0" description="Force seq_clk OFF" range="9" rwaccess="R/W"/>
	<bitfield id="REG_CLK_OFF" width="1" begin="8" end="8" resetval="0x0" description="Force reg_clk OFF" range="8" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="1" begin="7" end="7" resetval="0x0" description="This bit should be written with zero and ignored on reads." range="7" rwaccess="W"/>
	<bitfield id="DATA_RAM_CLK_ON" width="1" begin="6" end="6" resetval="0x0" description="Force data_ram_clk ON" range="6" rwaccess="R/W"/>
	<bitfield id="GF2M_CLK_ON" width="1" begin="5" end="5" resetval="0x0" description="Force gf2m_clk ON" range="5" rwaccess="R/W"/>
	<bitfield id="LNME_REG_CLK_ON" width="1" begin="4" end="4" resetval="0x0" description="Force lnme_reg_clk ON" range="4" rwaccess="R/W"/>
	<bitfield id="LNME_CLK_ON" width="1" begin="3" end="3" resetval="0x0" description="Force lnme_clk ON" range="3" rwaccess="R/W"/>
	<bitfield id="PKCP_CLK_ON" width="1" begin="2" end="2" resetval="0x0" description="Force pkcp_clk ON" range="2" rwaccess="R/W"/>
	<bitfield id="SEQ_CLK_ON" width="1" begin="1" end="1" resetval="0x0" description="Force seq_clk ON" range="1" rwaccess="R/W"/>
	<bitfield id="REG_CLK_ON" width="1" begin="0" end="0" resetval="0x0" description="Force reg_clk ON" range="0" rwaccess="R/W"/>
	</register><register id="HSM_PKA_PKA_SYSCONFIG" acronym="HSM_PKA_PKA_SYSCONFIG" offset="8176" width="32" description="Shell configuration.">
		<bitfield id="RESERVED_3" width="26" begin="31" end="6" resetval="0x0" description="This bit should be written with zero and ignored on reads. " range="31:6" rwaccess="W"/>
	<bitfield id="IDLEMODE" width="2" begin="5" end="4" resetval="0x2" description="Selects the module Idle mode. These bit combinations are only available: 00 = Force Idle mode: An IdleRequest is immediately acknowledged., 01 = No Idle mode: An IdleRequest is never acknowledged., 10 = Smart Idle mode: An IdleRequest is not acknowledged until the module is done processing [reset default]., 11 = Reserved" range="5:4" rwaccess="R/W"/>
	<bitfield id="RESERVED_2" width="2" begin="3" end="2" resetval="0x0" description="This bit should be written with zero and ignored on reads. " range="3:2" rwaccess="W"/>
	<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x1" description="If set to 1, the soft reset sequence is applied to the module." range="1" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="1" begin="0" end="0" resetval="0x0" description="This bit should be written with zero and ignored on reads. " range="0" rwaccess="W"/>
	</register><register id="HSM_PKA_PKA_SYSSTATUS" acronym="HSM_PKA_PKA_SYSSTATUS" offset="8180" width="32" description="Shell status.">
		<bitfield id="RESERVED_1" width="31" begin="31" end="1" resetval="0x0" description="These bits should be written with zero and ignored on reads." range="31:1" rwaccess="W"/>
	<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x0" description="When this bit reads1b the module reset is completed." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_PKA_IRQSTATUS" acronym="HSM_PKA_PKA_IRQSTATUS" offset="8184" width="32" description="Interrupt status.">
		<bitfield id="RESERVED_2" width="13" begin="31" end="19" resetval="0x0" description="These bits should not be written and ignored on reads." range="31:19" rwaccess="W"/>
	<bitfield id="GF2MIRQSTATRAW" width="1" begin="18" end="18" resetval="0x0" description="Raw GF2m Engine ready interrupt status. Note: The reset value of this bit is0b but this bit becomes1bdirectly after reset." range="18" rwaccess="R"/>
	<bitfield id="LNMEIRQSTATRAW" width="1" begin="17" end="17" resetval="0x0" description="Raw combined LNME0 &#38; LNME1 ready interrupt status. Note: The reset value of this bit is0b but this bit becomes1bdirectly after reset." range="17" rwaccess="R"/>
	<bitfield id="PKAIRQSTATRAW" width="1" begin="16" end="16" resetval="0x0" description="Raw main PKA interrupt status. The reset value of this bit is zero, but it will become high after a few cycles, to indicate that the PKA is ready to be used. For the Program ROM configuration this is within a few cycles after a reset, for the Program RAM configuration a few cycles after pulling the Sequencer out of reset [section 8.3.2], provided the firmware is loaded in Program RAM prior to that." range="16" rwaccess="R"/>
	<bitfield id="RESERVED_1" width="13" begin="15" end="3" resetval="0x0" description="These bits should not be written and ignored on reads." range="15:3" rwaccess="W"/>
	<bitfield id="GF2MIRQSTAT" width="1" begin="2" end="2" resetval="0x0" description="Masked GF2m Engine ready interrupt status.This interrupt can be enbled when setting the GF2mIrqEn bit in the PKA_IRQENABLE register. This interrupt can be cleared by Writing this bit. Writing1bclears the GF2m Engine ready interrupt.This bit is self-clearing; it does not have to be set to0bafterwards. Writing0bhas no effect." range="2" rwaccess="R"/>
	<bitfield id="LNMEIRQSTAT" width="1" begin="1" end="1" resetval="0x0" description="Masked combined LNME0 &#38; LNME1 ready interrupt status.This interrupt can be enbled when setting the LNMEIrqEn bit in the PKA_IRQENABLE register. This interrupt can be cleared by Writing this bit. Writing1bclears the combined LNME0 &#38; LNME1 ready interrupt. This bit is self-clearing; it does not have to be set to0bafterwards. Writing0bhas no effect." range="1" rwaccess="R"/>
	<bitfield id="PKAIRQSTAT" width="1" begin="0" end="0" resetval="0x0" description="Masked main PKA interrupt status.This interrupt can be enbled when setting the PkaIrqEn bit in the PKA_IRQENABLE register. This interrupt can be cleared by Writing this bit. Writing1bclears the main PKA interrupt. This bit is self-clearing; it does not have to be set to0bafterwards. Writing0bhas no effect." range="0" rwaccess="R"/>
	</register><register id="HSM_PKA_PKA_IRQENABLE" acronym="HSM_PKA_PKA_IRQENABLE" offset="8188" width="32" description="Interrupt enable.">
		<bitfield id="RESERVED_1" width="29" begin="31" end="3" resetval="0x0" description="These bits should not be written and ignored on reads." range="31:3" rwaccess="W"/>
	<bitfield id="GF2MIRQEN" width="1" begin="2" end="2" resetval="0x0" description="Enable the GF2m Engine interrupt." range="2" rwaccess="W"/>
	<bitfield id="LNMEIRQEN" width="1" begin="1" end="1" resetval="0x0" description="Enable the combined LNME0 &#38; LNME1 ready interrupt" range="1" rwaccess="W"/>
	<bitfield id="PKAIRQEN" width="1" begin="0" end="0" resetval="0x0" description="Enable the PKA interrupt." range="0" rwaccess="W"/>
	</register>
</module>